[
  "Chuck Norris once won an arm wrestling match,with both hands tied behind his back",
  "Every year Chuck Norris' birthday, March 10 is celebrated as Voluntary Roundhouse Kick Day. On this special day people volunteer to be roundhouse kicked by Chuck Norris in the face to show him how much he is loved. The next day, Chuck Norris hunts down everyone who didn't volunteer and roundhouse kick them for offending him.",
  "Chuck Norris once cast his fishing line into the Bearing Sea and caught a 176 lb halibut from his patio lawn chair in southern Oklahoma.",
  "Chuck Norris can mash a potato in one blow, with a skewer.",
  "Chuck Norris believes that Shanimal rocks.",
  "Yeah if anyone messes with will weston or ma bro gary i will kick their ass n shit on their graves and kill their children and shit on their childrens graves, also i think mc gr33n3ys rhymes are badass n Chuck Norris is a douchebag peace out from the nevilles :)",
  "It is said that, on average, men think about sex every seven seconds. That average is based solely on Chuck Norris.",
  "Chuck Norris doesn't need glasses. He just gets new eyeballs.",
  "If at first you don't succeed, you're not Chuck Norris.",
  "When Chuck Norris does a push up, he doesn't \"push up\", he pushes the earth down.",
  "It's a well-known fact that the most lethal substance on Earth is Chuck Norris adrenaline.",
  "Chuck Norris once cut a man into two equal diametrically opposing sections by giving him a wedgie.",
  "Hurricans, tornados, etc are caused by Chuck Norris roundhouse kicking the wind.",
  "If you are filled with terror that Chuck Norris is still out there, somewhere, that only proves that you are still sane.",
  "Chuck Norris will dissolve your face with an acidic fart if he considers your blowjob to be sub-par.",
  "Chuck Norris once skydived from the ionosphere. Why? Because he would be the only gold medalist to survive that kind of a fall.",
  "Chuck Norris once visited with the Cherokee Nation Tribal Council. It was there that Chief Running Wolf presented him the honorary Native American name of: Chuck Norris.",
  "Chuck Norris can win a game of Chess without moving his pawns.",
  "MacGyver immediately tried to make a bomb out of some Q-Tips and Gatorade, but Chuck Norris roundhouse-kicked him in the solar plexus. MacGyver promptly threw up his own heart.",
  "Chuck Norris has no enemies, he only has victims",
  "Chuck Norris did the worm up K2.",
  "This little piggy went to the market,this little piggy stayed home,this little piggy went we we we all the way home because Chuck Norris delivered a fatal roundhouse kick to the other piggy.",
  "\"Sweating bullets\" is literally what happens when Chuck Norris gets too hot.",
  "Chuck Norris' beard is what protects us from the sun's destructive ionizing radiation.",
  "Chuck Norris' family crest is a picture of a baracudda eating Queen Elizabeth.",
  "Chuck Norris can win a game of Trivial Pursuit with one roll of the dice, and without answering a single question... just a nod of the head, and a stroke of the beard.",
  "Did you know that Chuck Norris is not held on Earth by Gravity? He simply clings on the surface using his toes.",
  "Chuck Norris told the united states that russia was goin to nuc them during the cold war",
  "One time, Chuck Norris accidentally stubbed his toe. It destroyed the entire state of Ohio.",
  "Chuck Norris holds all the real-world cheat codes. Yeah, even the zombie one.",
  "Chuck Norris is so awesome, he caused blindness to the whole bat species just by his sheer awesomeness. Infact, if you listen intently all the bats shriek \"Chuck Norris! Chuck Norris! Chuck Norris!\".",
  "When Chuck Norris owns an Xbox 360 It never had the three rings of death because it's afraid of Chuck Norris.",
  "Chuck Norris has a full-size tattoo of his face...on his face.",
  "Chuck Norris can see John Cena",
  "While riding on a horse, Christopher Reeve once insulted Chuck Norris.",
  "Chuck Norris can alphebetize his M&M's. Skittles too.",
  "A life-sized 24-carat gold sculpture of Chuck Norris' penis was in the briefcase in Pulp Fiction. Tarantino removed the scene at the end when Uma Thurman finally receives it.",
  "Chuck Norris taught Tiger Woods everything Tiger knows about golf.",
  "Chuck Norris' penis has two little t-rex arms.",
  "Chuck Norris built the Egyptian Pyramids...in 1 day...during a Sandstorm...at night. He later built the Sphinx as a monument to honor his penis.",
  "The term 'crack a smile' actually was slang for one of Chuck Norris' signature moves, one he mainly uses for killing smug assholes.The term 'crack a smile' actually was slang for one of Chuck Norris' signature moves, one he mainly uses for killing smug assholes.",
  "UFO's don't stay long because they know Chuck Norris did not invite them",
  "The original title for Alien vs. Predator was Alien and Predator vs Chuck Norris. The film was cancelled shortly after going into preproduction. No one would pay nine dollars to see a movie fourteen seconds long.",
  "Miley Cyrus calls Chuck Norris daddy.",
  "Jimi Hendrix played a guitar. Chuck Norris played Jimi Hendrix",
  "Chuck Norris eats steak for every single meal. Most times he forgets to kill the cow.",
  "Arnold had to beg Chuck Norris for the role of Terminator.",
  "The big bang occured in Chuck Norris's appendix.",
  "Chuck Norris can exhale a huge plume of cigar smoke at any time.",
  "You know... Chuck Norris KNOWS Victoria's Secret... when he looks in the mirror his reflection runs away Probably his greatest accomplishment: He once round-house kicked someone so far his ody went back through time and hit Amelia Airheart's plane and it was shot down over the Pacific Ocean",
  "Chuck Norris loves how the harvest moon glistens upon hunted flesh.",
  "The Terminator needs your clothes, boots and your motorcycle, because Chuck Norris took his.",
  "Chuck Norris puts the K in knife. This is to confuse his prey.",
  "Women line up just for the thrill of giving Chuck Norris a hickey on his hemorrhoids.",
  "Duke Nukem was based on Chuck Norris.",
  "Chuck Norris actually has German blood. He keeps it in the fridge next to the mayonnaise.",
  "Chuck Norris' grandfather presented him with an alarm clock on his 7th birthday. Chuck Norris roundhouse kicked and broke the clock into a million pieces. Nothing alarms Chuck Norris. Btw Chuck Norris' grandfather is also Chuck Norris.",
  "Chuck Norris can plug that spilling oil pipe in the gulf of mexico. Call him on 1-200-HANG-UP",
  "Chuck Norris put out Hell.",
  "Chuck Norris combs his hair with a pitchfork.",
  "The skidmarks in Chuck Norris' underwear are actual tyre-tracks.",
  "Chuck Norris can play the violin...on the piano.",
  "Chuck Norris did not shoot the Sheriff or the Deputy but he did torch thier police cruiser with a flaming porcupine.",
  "Tom Clancy has to pay royalties to Chuck Norris because \"The Sum of All Fears\" is the name of Chuck Norris' autobiography.",
  "Chuck Norris head may be in the clouds but his round house kick is in the back of your face.",
  "Chuck Norris listens to his music in 4D",
  "Chuck Norris goes to the Dentist to get a tooth extracted. The Dentist ask do you want gas or a shot ? Chuck Norris answers your gonna need both. Moments after the procedure the Dentist(with blured vision and sore rectum)observes Chuck Norris slowly getting dressed.",
  "Most people need a liter when they burn down a forest. Chuck Norris only needs his ass and his lazer vision.",
  "One night Chuck Norris had Chili for dinner. The very next day the Big Bang happened.",
  "Chuck Norris can't live forever, forever died two years ago.",
  "When Chuck Norris does the 'got your nose' thing to kids, it is horrific to behold.",
  "Hitler didn't shoot himself he shot at Chuck Norris.",
  "Chuck Norris doesn't need to do anything for a Klondike Bar.",
  "the dinosaurs only became extinct after Chuck Norris had a BBQ, for one",
  "J. Wellington Wimpy did pay Chuck Norris back on Tuesday for a hamburger eaten that day.",
  "Chuck Norris owns a copy of Duke Nukem Forever. It will be released due to his neighbor \"borrowing\" it and never returning it. We pray for that man.",
  "Chuck Norris never draws a blank. He draws a chain gun from his underpants, then laughs as he turns you into hummus.",
  "Here's a fun fact: CHUCK NORRIS IS YOUR REAL FATHER AND HE SURE AS HELL DON'T LOVE YOU!!",
  "Chuck Norris lost his vriginity before his dad did.",
  "Chuck Norris once did a woman so hard she had to change churches.",
  "freakin Chuck Norris, is there nothing this guy can't do?",
  "Chuck Norris' toejam sells for over eight hundred dolars a bottle.",
  "Chuck Norris once got confused by looking at the infinity sign, so he roundhouse kicked it back into a clock, he now has it straped onto his wrist and calls it his wristwatch",
  "How much wood can a woodchuck chuck, if a woodchuck chuck could chuck wood? This question is irrelevant. A relevant question would be \"How many trees can Chuck Norris kick the woodchuck through\"?",
  "Chuck Norris discovered a new species of butterfy. The aptly named Chucknorrriscus Mortalitas (striking butterfly of death). It goes high into the air and takes a dramatic dive to crash into a human skull, literally splitting it open, giving the human only a few seconds to live after that. Then, it feeds on the human brain.",
  "Chuck Norris' car keys have killed many a man.",
  "God said \"Let there be light.\" Chuck Norris said, \"Let there be God.\"",
  "Chuck Norris had a staring contest with the sky, it fell.",
  "Chuck Norris won a staring competition with a mirror.",
  "Chuck Norris Doesn't Sleep...He Waits.",
  "If Chuck Norris takes the high road and you take the low road, Chuck Norris will still be to Scotland before ye.",
  "Chuck Norris views the Ironman Triathlon as \"a nice cool-down.\"",
  "Chuck Norris has a savings and a Chucking account",
  "Chuck Norris won the showcase on The Price Is Right even after bidding over the actual retail price.",
  "Chuck Norris doesn't use a cheese grater. He grates cheese with his beard",
  "Chuck Norris kills the elephant in the room.",
  "If you stab Chuck Norris with a knife, the knife bleeds..",
  "Chuck Norris can sing \"Yankee Doodle Dandy\" in a Jamaican Reggae voice.",
  "Texas Tea - Chuck Norris sweat",
  "If Chuck Norris steals money from a bank, the owner of the bank gets arrested for not just giving Chuck Norris the money.",
  "Chuck Norris can divide by zero",
  "Chuck Norris' penis is the size of a fire extinguisher. And can pretty much do the same job.",
  "An anagram for Walker Texas Ranger is KARATE WRANGLER SEX. I don't know what that is, but it sounds AWESOME.",
  "If you piss off Chuck Norris enough, he will knock your ass out, pull your eyelashes down far enough to hook them on your toenails and play you like a banjo.",
  "Many men envy Ron Jeremy's nine-inch-plus manhood. Ron Jeremy envies Chuck Norris' manhood.",
  "Teacher says every time a bell rings Chuck Norris kills an angel.",
  "When speaking in public about his multitude of lifetime accomplishments, Chuck Norris always appropriately refers to himself in the fourth-person.",
  "On every continent of the world, there is a sandwich named after Chuck Norris. On the North American continent it's the Knuckle Sandwich.",
  "Every time Chuck Norris leaves a room, the song \"There Goes My Hero\" starts playing out of nowhere.",
  "A single death is a tragedy; Chuck Norris roundhouse kick to the face is a statistic.",
  "Chuck Norris was banned from the Winter Olympics because the judges didnt know how to score a double-lutz flip-axle roundhouse kick to the face!!",
  "How many Chuck Norris' does it take to change a lightball? Nobody has ever asked him that and I suggest you keep quiet as well.",
  "quick how do u spell Chuck Norris .............. in that time you would already be dead by a roundhouse kick to the face twenty times before you get to c",
  "Chuck Norris doesn't get sick. So once, after eating some chicken infected with salmonella, he gut punched some skidrow bums until they threw-up for him.",
  "Grandma got run over by a reindeer. Then Chuck Norris mowed her down with his snowmobile and finished her off.",
  "Moammar Gadhafi was found when Chuck Norris flew over Libya and pointed him out.",
  "Chuck Norris was the fourth wise man, who gave baby Jesus the gift of beard, which he carried with him until he died. The other three wise men were enraged by the preference that Jesus showed to Chuck's gift, and arranged to have him written out of the bible. All three died soon after of mysterious roundhouse-kick related injuries.",
  "the last person to survive a roundhouse kick by Chuck Norris was michael jackson. then he turned white",
  "Crop circles are Chuck Norris' way of telling the world that sometimes corn needs to lie down.",
  "When I found out about this site, I roundhouse kicked it so hard it suddenly got a link to the Hugh Jackman fact generator. Nice guy. I went fishing with him once. Then I kicked his ass. Because I'm f***ing Chuck Norris.",
  "Its not that Chuck Norris cant handle the truth. The truth cant handle Chuck Norris",
  "No one has ever spoken during review of Chuck Norris' code and lived to tell about it.",
  "Chuck Norris doesn't even need to put the seat up when he urinates.",
  "Chuck Norris considers hurricane force winds to be \"a nice breeze\".",
  "If Chuck Norris was God, there would be no sand but only concrete, no water but only Liquir.",
  "Contrary to popular belief, the Titanic didn't hit an iceberg. The ship was off course and ran into Chuck Norris while he was doing the backstroke across the Atlantic.",
  "Chuck Norris can turn invisible by daring light to hit him.",
  "Chuck Norris is a PhD in Pain. However, his advances in the field of Pleasure have earned him a Nobel Prize.",
  "Chuck Norris once created a rock so heavy that even Chuck Norris couldn't lift it, then he lifted it anyway, just to show the who the fuck Chuck Norris is.",
  "they say Santa comes once a yer Chuck Norris comes twice a year",
  "Chuck Norris can play angry birds, listen to music and watch movies on a pay-phone... and all for free",
  "Guy walks up to Chuck Norris and says \"Get a life\". Chuck Norris says Okay . # 4089.",
  "Chuck Norris once possessed an evil spirit.",
  "Chuck Norris' penis has a penis. And it's still bigger than yours!",
  "Chuck Norris has never struck out in Baseball. He simply stares at the ball, and it gets out of his way.",
  "Chuck Norris smoked charlie sheen to get a high,an still couldn't catch a buzz.",
  "Chuck Norris' bidet is hooked up to a municipal fire hydrant.",
  "Believe it or not, people living in the jungles of Southeast Asia wore a Chuck Norris face mask on the back of their heads to prevent tigers from attacking them from behind.",
  "Seconds after you read this joke, Chuck Norris will appear, kill you, your family, and your pets, then he'll go eat some Carl's Jr; and that's just the way it is.",
  "Chuck Norris once ejaculated for forty-five minutes straight.",
  "the first thing Chuck Norris said wen he was born was ..... i hate corey",
  "Chuck Norris is the reason why bats can't see cause they took one look at him and they went blind.",
  "E equals M C squared. Chuck Norris equals death, period.",
  "Despite popular belief, Neil Armstrong wasn't the first man on the moon, but some random dude named Steve who insulted Chuck Norris by saying that his beard looked stupid. The reason why noone found Steve's remains was because he evaporated on impact with the moon.",
  "Chuck Norris uses beef jerky as nunchucks.",
  "Chuck Norris' dog once ran into the street, and a car got ran over by it",
  "Chuck Norris can piss his name in mid-air.",
  "Chuck Norris' mom always looks forward to every Mothers Day. Her loving son always provides her favorite gift...an uppercut.",
  "Someone once used Chuck Norris' name in a men's restroom graffiti. That is correct, \"once\"! The body of a castrated man was later found by police floating in the city sewer system.",
  "Chuck Norris can Halo jump without a parachute in the air 20 billion times and touch a target on the ground with ease.",
  "Chuck Norris can fly on an airplane to Maine from Hawaii in 30 seconds. he just has to tell the pilot to move over...",
  "Chuck Norris is the only man who has hit 5 home runs while playing in the Super Bowl.",
  "The cookie crumbled because Chuck Norris glanced at it",
  "I caught my girlfriend cheating on me with Chuck Norris. It was the most beautiful thing I'd seen in my life",
  "Katy Perry kissed a girl to get attention from Chuck Norris.",
  "Brain dead zombies are smart enough to stay the hell away from Chuck Norris.",
  "Chuck Norris was banned from the show Survivor, his primal instincts take over; he killed and ate 5 players. Survive to Chuck Norris means something different.",
  "Chuck Norris brushes his teeth with a machine gun and flosses with a lightsaber.",
  "If Chuck Norris fights with himself it's a win-win situation.",
  "Chuck Norris knows what you did last summer.",
  "When Chuck Norris goes swimming sharks hear scary music.",
  "Chuck Norris taught spongebob how to make a camp fire. Underwater.",
  "Whenever you knock on wood, that's Chuck Norris' cue to hack an orphan to death.",
  "Chuck Norris once screamed \"bloody murder\" in sign language for the hearing impaired.",
  "The devil has a Chuck Norris-may-care attitude.",
  "Chuck Norris likes to scare the shit out of Saint Peter by killing people so hard they smash into the pearly gates.",
  "With Chuck Norris P = NP. There's no nondeterminism with Chuck Norris decisions.",
  "Chuck Norris raised the Maine with his penis. Now you don't have to remember it anymore.",
  "Chuck Norris punched a gift horse in the mouth",
  "Shit got the Chuck Norris scared out of it..;)",
  "Jesus could turn water into wine. Chuck Norris can turn his own piss into award-winning top shelf whiskey.",
  "Man, I thought it was gonna rain today but Chuck Norris come&#65279; down and roundhouse kicked the weatherman.",
  "Using his trademark roundhouse kick, Chuck Norris once made a fieldgoal in RJ Stadium in Tampa Bay from the 50 yard line of Qualcomm stadium in San Diego.",
  "Chuck Norris' mother wears bowling ball earrings.",
  "Chuck Norris's wife uses insurance provided birth control pills. Wonder why Rush Limbaugh didn't call her a slut?",
  "When you get impregnated by Chuck Norris, the following will happen: as soon as you wake up out of your coma, you will have just enough time to see the doctor jump out of the way before you explode, unleashing at least nine little bearded Chucklings into the world.",
  "Chuck Norris buries the hatchet... in the back of your head.",
  "Chuck Norris can quick scope with akimbo interventions on MW2",
  {},
  "CHUCK NORRIS IS THE REASON HITLER KILLED HIMSELF. HE KNEW HE COULD NOT TAKE OVER THE WORLD WITH HIM STILL IN IT. NOBODY CAN TELL CHUCK WAT TO DO.",
  "Don't try Chuck Norris at home",
  "Stephen King refused to write Chuck Norris' biography, as he considered the story too 'scary and gruesome'. An enraged Norris ran him over in a panel van, then framed a hillbilly for it.",
  "Chuck Norris owns a playstation 360",
  "Chuck Norris had what Meg Ryan was having.",
  "Chuck Norris once revived a dead, beached Humpback Whale by performing CPR and then throwing it back into the Pacific Ocean.",
  "Chuck Norris has never worn underwear not made out of leather.",
  "Chuck Norris once rammed a banjo up a bull's butt, and then hit it.",
  "Mc Hammer learned the hard way that Chuck Norris can touch this.",
  "Chuck Norris & the Late Chip Reese played a hand in the men's toilet in one casino in Las Vegas. The toilet is now known as 'Bobby's room'.",
  "when god said let there be light,Chuck Norris said ill think about it",
  "For a split of a nanosec I had disbelief in Chuck Norris, but quickly I noticed that this particular nanosec was splitted by his karatepunch.",
  "Kronic king has a secret yearning for Chuck Norris' boner."
]